<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>萝卜头的日志</title>
  
  
  <link href="/atom.xml" rel="self"/>
  
  <link href="https://bygeek.cn/"/>
  <updated>2020-01-31T16:23:02.467Z</updated>
  <id>https://bygeek.cn/</id>
  
  <author>
    <name>byGeek</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>2020-new-year</title>
    <link href="https://bygeek.cn/2020/01/31/2020-new-year/"/>
    <id>https://bygeek.cn/2020/01/31/2020-new-year/</id>
    <published>2020-01-31T06:02:32.000Z</published>
    <updated>2020-01-31T16:23:02.467Z</updated>
    

    <content type="html"><![CDATA[<p>最近在看Lippman的《Inside the c++ object model》，书中Lippman说有人发邮件问了他一个问题。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span> &#123;</span>&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Y</span> :</span> <span class="keyword">public</span> <span class="keyword">virtual</span> X&#123;&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Z</span>:</span> <span class="keyword">public</span> <span class="keyword">virtual</span> X&#123;&#125;;</span><br><span class="line"></span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">A</span>:</span><span class="keyword">public</span> Y, <span class="keyword">public</span> Z&#123;&#125;;</span><br></pre></td></tr></table></figure><p>根据以上定义，使用sizeof运算符分别计算类X,Y,Z,A的所占大小。</p><a id="more"></a><p>答案公布：</p><p>在msvc140和gcc 5.4环境下测试：</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">size_t</span> temp = <span class="keyword">sizeof</span>(X); <span class="comment">//1</span></span><br><span class="line">temp = <span class="keyword">sizeof</span>(Y);  <span class="comment">//4</span></span><br><span class="line">temp = <span class="keyword">sizeof</span>(Z);  <span class="comment">//4</span></span><br><span class="line">temp = <span class="keyword">sizeof</span>(A);  <span class="comment">//8</span></span><br></pre></td></tr></table></figure><h2 id="为什么sizeof-X-为1？"><a href="#为什么sizeof-X-为1？" class="headerlink" title="为什么sizeof(X)为1？"></a>为什么sizeof(X)为1？</h2><p>X是一个”空类”，按理来说sizeof(X)应该是0，因为没有数据需要存储。为何sizeof(X)为1呢？</p><p>Lippman给出的解释是，如果空类所占空间为0，则类的两个不同的实例地址就相同，这样的结果显然不是我们想要的。编译器自动给空类插入占用一字节的char数据成员，这样可以保证不同的对象会分配唯一的地址空间。</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">X a, b;</span><br><span class="line"><span class="keyword">if</span>(&amp;a == &amp;b) <span class="built_in">cerr</span> &lt;&lt; <span class="string">"yipes"</span> &lt;&lt;<span class="built_in">endl</span>;</span><br></pre></td></tr></table></figure><p>在《Effective c++》中item 39中，作者提到：freestanding objects必须有Non-zero size，对于大多数编译器，sizeof(X)是1，是因为编译器插入一个char完成的。</p><p>在<a href="https://en.cppreference.com/w/cpp/language/ebo" target="_blank" rel="noopener">cppreference</a>可以找到相关的标准规定:</p><blockquote><p>The size of any <a href="https://en.cppreference.com/w/cpp/language/object" target="_blank" rel="noopener">object</a> or member subobject (unless [[no_unique_address]] – see below) (since C++20) is required to be at least 1 even if the type is an empty <a href="https://en.cppreference.com/w/cpp/language/class" target="_blank" rel="noopener">class type</a> (that is, a class or struct that has no non-static data members), in order to be able to guarantee that the addresses of distinct objects of the same type are always distinct.</p></blockquote><h2 id="为什么sizeof-Y-sizeof-Z-为4？"><a href="#为什么sizeof-Y-sizeof-Z-为4？" class="headerlink" title="为什么sizeof(Y), sizeof(Z)为4？"></a>为什么sizeof(Y), sizeof(Z)为4？</h2><p>先来考虑另外一个问题</p><figure class="highlight cpp"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span>&#123;</span>&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Q</span>:</span> <span class="keyword">public</span> X&#123;</span><br><span class="line">    <span class="keyword">private</span>:</span><br><span class="line">    <span class="keyword">int</span> data;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure><p>Q继承自空类X，考虑到sizeof(X) = 1, 那么Q类的所占空间是sizeof(int)还是sizeof(int) + 1?</p><p>答案是根据Empty base optimization原则，Q所占空间为sizeof(int)。也就是说base class所占空间被“优化”掉了。但是这里我们class Y， Z并没有数据成员，sizeof(Y) == sizeof(Z)  == 4。</p><p>这是因为使用了virtual inheritance。一旦跟<strong>virtual</strong>扯上关系，编译器又在背后偷偷的做了一些事情。</p><p>为了实现面向对象中的多态特性，大多数编译器都会将一个vptr插入到the most base class中，vptr指向vtable。关于vtable的相关知识，请参考我的这篇<a href="https://bygeek.cn/2018/10/22/vtable-and-object-memory-layout-in-cpp-language/">博文</a>。正是因为vptr指针占用4个字节，并且基于empty base optimization原则，所以sizeof(Y) = 4。</p><h2 id="为什么sizeof-A-为8？"><a href="#为什么sizeof-A-为8？" class="headerlink" title="为什么sizeof(A)为8？"></a>为什么sizeof(A)为8？</h2><p>因为virtual继承关系，编译器会在Y，Z的memory layout中加入一个vptr指针。在多重继承下，X的memory layout会包含Y,Z的vptr，所以sizeof(A)为8。</p><h2 id="如看查看memory-layout"><a href="#如看查看memory-layout" class="headerlink" title="如看查看memory layout"></a>如看查看memory layout</h2><h3 id="MSVC"><a href="#MSVC" class="headerlink" title="MSVC"></a>MSVC</h3><p>在msvc下我们可以使用编译器选项<code>/d1reportSingleClassLayout&lt;classname&gt;</code>， <code>/d1reportAllClassLayout</code>来查看memory layout。打开visual studio 开发者prompt</p><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp /d1reportAllClassLayout</span><br></pre></td></tr></table></figure><p>如果包含的类比较多，可以将输出信息重定向到文件中，方便查看。</p><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp /d1reportAllClassLayout &gt; &quot;d:\out.txt&quot;</span><br></pre></td></tr></table></figure><p>在MSVC140下dump出来的memory layout如下：</p><figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br></pre></td><td class="code"><pre><span class="line">class Xsize(1):</span><br><span class="line">+---</span><br><span class="line">+---</span><br><span class="line"></span><br><span class="line">class Ysize(4):</span><br><span class="line">+---</span><br><span class="line"> 0| &#123;vbptr&#125;</span><br><span class="line">+---</span><br><span class="line">+--- (virtual base X)</span><br><span class="line">+---</span><br><span class="line"></span><br><span class="line">Y::$vbtable@:</span><br><span class="line"> 0| 0</span><br><span class="line"> 1| 4 (Yd(Y+0)X)</span><br><span class="line">vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class Zsize(4):</span><br><span class="line">+---</span><br><span class="line"> 0| &#123;vbptr&#125;</span><br><span class="line">+---</span><br><span class="line">+--- (virtual base X)</span><br><span class="line">+---</span><br><span class="line"></span><br><span class="line">Z::$vbtable@:</span><br><span class="line"> 0| 0</span><br><span class="line"> 1| 4 (Zd(Z+0)X)</span><br><span class="line">vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class Asize(8):</span><br><span class="line">+---</span><br><span class="line"> 0| +--- (base class Y)</span><br><span class="line"> 0| | &#123;vbptr&#125;</span><br><span class="line">| +---</span><br><span class="line"> 4| +--- (base class Z)</span><br><span class="line"> 4| | &#123;vbptr&#125;</span><br><span class="line">| +---</span><br><span class="line">+---</span><br><span class="line">+--- (virtual base X)</span><br><span class="line">+---</span><br><span class="line"></span><br><span class="line">A::$vbtable@Y@:</span><br><span class="line"> 0| 0</span><br><span class="line"> 1| 8 (Ad(Y+0)X)</span><br><span class="line"></span><br><span class="line">A::$vbtable@Z@:</span><br><span class="line"> 0| 0</span><br><span class="line"> 1| 4 (Ad(Z+0)X)</span><br><span class="line">vbi:   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       8       0       4 0</span><br></pre></td></tr></table></figure><h3 id="GCC"><a href="#GCC" class="headerlink" titl