<?xml version="1.0" encoding="utf-8"?>
<search>
  <entry>
    <title>2018-new-year</title>
    <url>/2018/02/23/2018-new-year/</url>
    <content><![CDATA[<p>2018年上班第一天。</p>
<span id="more"></span>

<p>前些日子一直想做点开年计划，今天趁着不那么忙，把这些计划记录到自己的博客中。希望自己在这一年中能坚持做下来。</p>
<ul>
<li>跑步减肥，目标是73KG。前几天搬家，越来越意识到自己真实越来越胖了</li>
<li>把博客运行起来。想来这个博客搭建好之后都快一年了，内容还只有first-blog-test。。。</li>
<li>看书，专业书和自己买的两本社科书。关于要看的书，再写一遍博文描述一下。</li>
<li>开发一个能上线的小程序/app，或者有自己的一个开源项目。</li>
<li>攒钱去一趟香港旅游。</li>
</ul>
<p>2018/2/23 于公司</p>
]]></content>
      <categories>
        <category>notes</category>
      </categories>
      <tags>
        <tag>plan</tag>
      </tags>
  </entry>
  <entry>
    <title>2019-new-year</title>
    <url>/2019/02/11/2019-new-year/</url>
    <content><![CDATA[<p>今天初七，2019年上班第一天。</p>
<span id="more"></span>

<p>今年的计划如下：</p>
<h3 id="减脂"><a href="#减脂" class="headerlink" title="减脂"></a>减脂</h3><p>体重控制在69kg，全年跑量1000km。我知道这个目标其实很弱鸡，如果不出问题，应该可以很轻松的达成。但贵在坚持。坚持跑步，要对得起18年自己买的跑鞋。注意更加科学的跑步，加强自己的核心力量。</p>
<h3 id="书单"><a href="#书单" class="headerlink" title="书单"></a>书单</h3><p>专业书：</p>
<ul>
<li>Windows via C++</li>
<li>APUE</li>
<li>Inside the C++ Object Model</li>
<li>Effective STL</li>
<li>COM技术内幕-微软组件模型</li>
</ul>
<p>非专业书</p>
<ul>
<li>二战全史</li>
<li>尤瓦尔·赫拉利 三部曲：人类简史（看过了觉得还要重新看一遍），未来简史，今日简史</li>
<li>Kindle上ISIS的崛起</li>
<li>中央帝国的财政密码（去年未看完）</li>
</ul>
<h3 id="人生大事"><a href="#人生大事" class="headerlink" title="人生大事"></a>人生大事</h3><p>打算今年多关注一些房子的信息，多收集收集资料。</p>

<p>在<a href="https://en.cppreference.com/w/cpp/language/ebo">cppreference</a>可以找到相关的标准规定:</p>
<blockquote>
<p>The size of any <a href="https://en.cppreference.com/w/cpp/language/object">object</a> or member subobject (unless [[no_unique_address]] – see below) (since C++20) is required to be at least 1 even if the type is an empty <a href="https://en.cppreference.com/w/cpp/language/class">class type</a> (that is, a class or struct that has no non-static data members), in order to be able to guarantee that the addresses of distinct objects of the same type are always distinct.</p>
</blockquote>
<h2 id="为什么sizeof-Y-sizeof-Z-为4？"><a href="#为什么sizeof-Y-sizeof-Z-为4？" class="headerlink" title="为什么sizeof(Y), sizeof(Z)为4？"></a>为什么sizeof(Y), sizeof(Z)为4？</h2><p>先来考虑另外一个问题</p>
<figure class="highlight cpp"><table><tr><td class="code"><pre><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">X</span>&#123;</span>&#125;;</span><br><span class="line"><span class="class"><span class="keyword">class</span> <span class="title">Q</span>:</span> <span class="keyword">public</span> X&#123;</span><br><span class="line">    <span class="keyword">private</span>:</span><br><span class="line">    	<span class="keyword">int</span> data;</span><br><span class="line">&#125;</span><br></pre></td></tr></table></figure>

<p>Q继承自空类X，考虑到sizeof(X) = 1, 那么Q类的所占空间是sizeof(int)还是sizeof(int) + 1?</p>
<p>答案是根据Empty base optimization原则，Q所占空间为sizeof(int)。也就是说base class所占空间被“优化”掉了。但是这里我们class Y， Z并没有数据成员，sizeof(Y) == sizeof(Z)  == 4。</p>
<p>这是因为使用了virtual inheritance。一旦跟<strong>virtual</strong>扯上关系，编译器又在背后偷偷的做了一些事情。</p>
<p>为了实现面向对象中的多态特性，大多数编译器都会将一个vptr插入到the most base class中，vptr指向vtable。关于vtable的相关知识，请参考我的这篇<a href="https://bygeek.cn/2018/10/22/vtable-and-object-memory-layout-in-cpp-language/">博文</a>。正是因为vptr指针占用4个字节，并且基于empty base optimization原则，所以sizeof(Y) = 4。</p>
<h2 id="为什么sizeof-A-为8？"><a href="#为什么sizeof-A-为8？" class="headerlink" title="为什么sizeof(A)为8？"></a>为什么sizeof(A)为8？</h2><p>因为virtual继承关系，编译器会在Y，Z的memory layout中加入一个vptr指针。在多重继承下，X的memory layout会包含Y,Z的vptr，所以sizeof(A)为8。</p>
<h2 id="如看查看memory-layout"><a href="#如看查看memory-layout" class="headerlink" title="如看查看memory layout"></a>如看查看memory layout</h2><h3 id="MSVC"><a href="#MSVC" class="headerlink" title="MSVC"></a>MSVC</h3><p>在msvc下我们可以使用编译器选项<code>/d1reportSingleClassLayout&lt;classname&gt;</code>， <code>/d1reportAllClassLayout</code>来查看memory layout。打开visual studio 开发者prompt</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp &#x2F;d1reportAllClassLayout</span><br></pre></td></tr></table></figure>

<p>如果包含的类比较多，可以将输出信息重定向到文件中，方便查看。</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp &#x2F;d1reportAllClassLayout &gt; &quot;d:\out.txt&quot;</span><br></pre></td></tr></table></figure>

<p>在MSVC140下dump出来的memory layout如下：</p>
<figure class="highlight plain"><table><tr><td class="code"><pre><span class="line">class X	size(1):</span><br><span class="line">	+---</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">class Y	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Y::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Yd(Y+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class Z	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Z::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Zd(Z+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class A	size(8):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Y)</span><br><span class="line"> 0	| | &#123;vbptr&#125;</span><br><span class="line">	| +---</span><br><span class="line"> 4	| +--- (base class Z)</span><br><span class="line"> 4	| | &#123;vbptr&#125;</span><br><span class="line">	| +---</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">A::$vbtable@Y@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 8 (Ad(Y+0)X)</span><br><span class="line"></span><br><span class="line">A::$vbtable@Z@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Ad(Z+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       8       0       4 0</span><br><span class="line"></span><br></pre></td></tr></table></figure>

