<!DOCTYPE html>












  


<html class="theme-next mist use-motion" lang="zh-CN">
<head><meta name="generator" content="Hexo 3.9.0">
  <meta charset="UTF-8">
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=2">
<meta name="theme-color" content="#222">












<meta http-equiv="Cache-Control" content="no-transform">
<meta http-equiv="Cache-Control" content="no-siteapp">






















<link href="/lib/font-awesome/css/font-awesome.min.css?v=4.6.2" rel="stylesheet" type="text/css">

<link href="/css/main.css?v=6.4.0" rel="stylesheet" type="text/css">


  <link rel="apple-touch-icon" sizes="180x180" href="/favicon-64x64.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png?v=6.4.0">


  <link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png?v=6.4.0">


  <link rel="mask-icon" href="/favicon-128x128.png?v=6.4.0" color="#222">









<script type="text/javascript" id="hexo.configurations">
  var NexT = window.NexT || {};
  var CONFIG = {
    root: '/',
    scheme: 'Mist',
    version: '6.4.0',
    sidebar: {"position":"right","display":"post","offset":12,"b2t":false,"scrollpercent":false,"onmobile":false},
    fancybox: false,
    fastclick: false,
    lazyload: false,
    tabs: true,

<p>为了实现面向对象中的多态特性，大多数编译器都会将一个vptr插入到the most base class中，vptr指向vtable。关于vtable的相关知识，请参考我的这篇<a href="https://bygeek.cn/2018/10/22/vtable-and-object-memory-layout-in-cpp-language/">博文</a>。正是因为vptr指针占用4个字节，并且基于empty base optimization原则，所以sizeof(Y) = 4。</p>
<h2 id="为什么sizeof-A-为8？"><a href="#为什么sizeof-A-为8？" class="headerlink" title="为什么sizeof(A)为8？"></a>为什么sizeof(A)为8？</h2><p>因为virtual继承关系，编译器会在Y，Z的memory layout中加入一个vptr指针。在多重继承下，X的memory layout会包含Y,Z的vptr，所以sizeof(A)为8。</p>
<h2 id="如看查看memory-layout"><a href="#如看查看memory-layout" class="headerlink" title="如看查看memory layout"></a>如看查看memory layout</h2><h3 id="MSVC"><a href="#MSVC" class="headerlink" title="MSVC"></a>MSVC</h3><p>在msvc下我们可以使用编译器选项<code>/d1reportSingleClassLayout&lt;classname&gt;</code>， <code>/d1reportAllClassLayout</code>来查看memory layout。打开visual studio 开发者prompt</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp /d1reportAllClassLayout</span><br></pre></td></tr></table></figure>
<p>如果包含的类比较多，可以将输出信息重定向到文件中，方便查看。</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">cl.exe your_source_file_path.cpp /d1reportAllClassLayout &gt; &quot;d:\out.txt&quot;</span><br></pre></td></tr></table></figure>
<p>在MSVC140下dump出来的memory layout如下：</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br></pre></td><td class="code"><pre><span class="line">class X	size(1):</span><br><span class="line">	+---</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">class Y	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Y::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Yd(Y+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class Z	size(4):</span><br><span class="line">	+---</span><br><span class="line"> 0	| &#123;vbptr&#125;</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">Z::$vbtable@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Zd(Z+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       4       0       4 0</span><br><span class="line"></span><br><span class="line">class A	size(8):</span><br><span class="line">	+---</span><br><span class="line"> 0	| +--- (base class Y)</span><br><span class="line"> 0	| | &#123;vbptr&#125;</span><br><span class="line">	| +---</span><br><span class="line"> 4	| +--- (base class Z)</span><br><span class="line"> 4	| | &#123;vbptr&#125;</span><br><span class="line">	| +---</span><br><span class="line">	+---</span><br><span class="line">	+--- (virtual base X)</span><br><span class="line">	+---</span><br><span class="line"></span><br><span class="line">A::$vbtable@Y@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 8 (Ad(Y+0)X)</span><br><span class="line"></span><br><span class="line">A::$vbtable@Z@:</span><br><span class="line"> 0	| 0</span><br><span class="line"> 1	| 4 (Ad(Z+0)X)</span><br><span class="line">vbi:	   class  offset o.vbptr  o.vbte fVtorDisp</span><br><span class="line">               X       8       0       4 0</span><br></pre></td></tr></table></figure>
